# [S1]본대 산책
import sys
input = sys.stdin.readline

d = int(input())

dp = [[0] * (d+1) for _ in range(8)]
# 0: 정보관 1:전산관 2:미래관 3:신양관 4:한경직 5:진리관 6:형남공학관 7:학생회관
dp[0][0] = 1
for i in range(1, d+1):
    dp[0][i] = (dp[1][i-1] + dp[2][i-1]) % 1000000007
    dp[1][i] = (dp[0][i-1] + dp[2][i-1] + dp[3][i-1]) % 1000000007
    dp[2][i] = (dp[0][i-1] + dp[1][i-1] + dp[3][i-1] + dp[4][i-1]) % 1000000007
    dp[3][i] = (dp[1][i-1] + dp[2][i-1] + dp[4][i-1] + dp[5][i-1]) % 1000000007
    dp[4][i] = (dp[2][i-1] + dp[3][i-1] + dp[5][i-1] + dp[6][i-1]) % 1000000007
    dp[5][i] = (dp[3][i-1] + dp[4][i-1] + dp[7][i-1]) % 1000000007
    dp[6][i] = (dp[4][i-1] + dp[7][i-1]) % 1000000007
    dp[7][i] = (dp[5][i-1] + dp[6][i-1]) % 1000000007

print(dp[0][d])
